## 数据库

# 1. 数据库的介绍
#     数据库就是存储和管理数据的仓库,数据按照一定的格式进行存储,用户可以对数据库中的数据进行增加、修改、删除、查询等等操作

# 2. 数据库的分类
#     关系型数据库
#         定义:
#           是指采用了关系模型来组织数据的数据库,简单来说,关系模型值得就是二维表格模型,强调使用表格的方式存储数据
#         核心元素:
#             数据行数据列
#             数据表
#             数据库(数据表的集合)
#         常用的关系型数据库:
#             Oracle
#             MySql
#             SQLite
#             Microsoft SQL Server

#      非关系型数据库
#         定义:
#             非关系型数据库,又称为NoSql(Not only SQL),意为不仅仅是SQL,对NoSql最普遍的定义时`非关联型`,强调key-value的方式存储数据
#         常用的非关系型数据库:
#             MongoDB & Redis
        
# 3. 数据库的作用就是存储和管理数据

# 4. 数据库的特点
#     持久化存储
#     读写速度极高
#     保证数据的有效性

# 5. 小结
#     数据库就是存储和管理数据的一个仓库,是用来持久化存储和快速读取数据的
#     数据库可以氛围关系型和非关系型数据库